package sis.summer;

import sis.studentinfo.Course;
import sis.studentinfo.DateUtil;
import sis.studentinfo.Session;
import sis.studentinfo.SessionTest;

import java.util.Date;

/**
 * <p>Title: SummerCourseSessionTest</p>
 * <p>Description: SummerCourseSessionTest</p>
 * <p>Copyright: Copyright (c) 2012</p>
 * <p>Company: Kewill-IPACS e-Solutions (S) Pte Ltd.</p>
 *
 * @author <shaolong.huang@kewill-ipacs.com>
 */
public class SummerCourseSessionTest extends SessionTest {
    public void testEndDate(){
//        Date startDate = DateUtil.createDate(2012,8,16);
//        Session session = createSession("ENGL","202",startDate);
        Date endDate = DateUtil.createDate(2012,10,8);
        assertEquals(endDate,session.getEndDate());

    }

    protected Session createSession(Course course, Date startDate) {
        return SummerCourseSession.create(course,  startDate);
    }

    public static void main(String[] args) {
        /*
        Long time1 = new Date().getTime();
        String str = "1.<现在,发现你的优势>  9787500648192 12/28/2009 3:50 PM2.<小王子>圣.埃克苏佩里 9787802282902  12/28/2009 3:50 PM3.<梦的解析>弗洛伊德 9787805797205 1/4/2010 6:45 PM4.<精神分析学引论.新论>弗洛伊德 97878057972121/4/2010 6:45 PM5.<性学与爱情心理学>弗洛伊德 9787805797199  1/4/2010 6:46 PM6.<明朝那些事儿>第一部当年明月  9787505722460 1/10/2010 2:21 PM7.<明朝那些事儿>第二部当年明月  9787505722859  1/10/2010 2:21 PM8.<明朝那些事儿>第三部当年明月 9787505723269" +
                " 1/10/2010 2:21 PM9.<杜拉拉升职记>李可 9787561339121 1/10/2010 2:21 PM10.<世界因你不同>李开复范海涛 9787508616780 1/10/2010 2:21 PM11.<我们台湾这些年>廖信忠 9787229012755 1/10/2010 2:21 PM12.<秘密>1/17/2010 2:21 PM13.<激荡三十年>上1/17/2010 2:21 PM14.<激荡三十年>下1/17/2010 2:21 PM15.<算法导论>1/27/2010 2:21 PM16.<人性的弱点>2/5/2010 2:21 PM17.<穆斯林的葬礼> 2/5/2010 2:21 PM18.<神秘岛>凡尔纳  2/9/2010 2:21 PM19.<格兰特船长的儿女>凡尔纳  2/9/2010 2:21 PM20.<八十天环游地球>凡尔纳  2/9/2010 2:21 PM21.<海底两万里>凡尔纳  2/9/2010 2:21 PM22.<聊斋志异>3/10/2010 2:03 PM23.<东周列国志>3/10/2010 2:03 PM24.<搜神记>3/10/2010 2:08";
        Long time2 = new Date().getTime();
        System.out.println("Time used:["+(time2-time1)+"]");

        String str2 = "1.<现在,发现你的优势>  9787500648192 12/28/2009 3:50 PM" +
                "2.<小王子>圣.埃克苏佩里 9787802282902  12/28/2009 3:50 PM" +
                "3.<梦的解析>弗洛伊德 9787805797205 1/4/2010 6:45 PM" +
                "4.<精神分析学引论.新论>弗洛伊德 97878057972121/4/2010 6:45 PM" +
                "5.<性学与爱情心理学>弗洛伊德 9787805797199  1/4/2010 6:46 PM" +
                "6.<明朝那些事儿>第一部当年明月  9787505722460 1/10/2010 2:21 PM" +
                "7.<明朝那些事儿>第二部当年明月  9787505722859  1/10/2010 2:21 PM" +
                "8.<明朝那些事儿>第三部当年明月 9787505723269 1/10/2010 2:21 PM" +
                "9.<杜拉拉升职记>李可 9787561339121 1/10/2010 2:21 PM" +
                "10.<世界因你不同>李开复范海涛 9787508616780 1/10/2010 2:21 PM" +
                "11.<我们台湾这些年>廖信忠 9787229012755 1/10/2010 2:21 PM" +
                "12.<秘密>1/17/2010 2:21 PM" +
                "13.<激荡三十年>上1/17/2010 2:21 PM" +
                "14.<激荡三十年>下1/17/2010 2:21 PM" +
                "15.<算法导论>1/27/2010 2:21 PM" +
                "16.<人性的弱点>2/5/2010 2:21 PM" +
                "17.<穆斯林的葬礼> 2/5/2010 2:21 PM" +
                "18.<神秘岛>凡尔纳  2/9/2010 2:21 PM" +
                "19.<格兰特船长的儿女>凡尔纳  2/9/2010 2:21 PM" +
                "20.<八十天环游地球>凡尔纳  2/9/2010 2:21 PM" +
                "21.<海底两万里>凡尔纳  2/9/2010 2:21 PM" +
                "22.<聊斋志异>3/10/2010 2:03 PM" +
                "23.<东周列国志>3/10/2010 2:03 PM" +
                "24.<搜神记>3/10/2010 2:08 PM" +
                "25.<程序员2009精华本>3/12/2010 10:08 AM" +
                "26.<Android应用开发揭秘>3/12/2010 10:08 AM" +
                "27.<经济学>第18版萨缪尔森3/17/2010 10:08 AM" +
                "28.<Ajax与Java高级程序设计>3/17/2010 10:08 AM" +
                "29.<明朝那些事儿>第四部  4/12/2010 10:08 AM" +
                "30.<少有人走的路:心智成熟的旅程>  5/7/2010 10:08 AM" +
                "31.<高校程序员的45个习惯:敏捷开发修炼之道> 5/7/2010 10:08 AM" +
                "32.<明朝那些事儿第五部>  5/10/2010 10:08 AM" +
                "33.<明朝那些事儿第六部>  5/10/2010 10:08 AM" +
                "34.<明朝那些事儿第七部大结局>  5/10/2010 10:08 AM" +
                "35.<丁丁历险记全集>共22本  5/21/2010 10:30AM" +
                "36.<侯卫东官场笔记>  6/17/2010 12:30AM" +
                "37.<走出软件作坊>  6/17/2010 12:30AM" +
                "38.<时间简史> 7/05/2010 12:30AM" +
                "39.<Agile Java中文版:测试驱动开发的编程技术>  7/05/2010 12:30AM" +
                "40.《大话设计模式》1/02/2011 1:00:21 AM" +
                "41.《重构改善既有代码的设计》4/16/2011 12:55 AM" +
                "42.《普通心理学》》4/26/2011 12:55 AM" +
                "43. 《看懂世界格局的第一本书》》5/5/2011 16:55 AM" +
                "44.《经济学原理 微观经济学分册》5/5/2011 16:55 AM" +
                "45.《经济学原理 宏观经济学分册》5/5/2011 16:55 AM" +
                "46.《致我们终将逝去的青春》5/5/2011 16:55 AM" +
                "47.《代码大全》第二版 5/15/2011 14:55 AM" +
                "48.《见证通胀》 6/08/2011 14:55 PM" +
                "49.《人月神话》 6/08/2011 14:55 PM" +
                "50.《下一个十年，消费崩盘的年代》6/24/2011 14:55 PM" +
                "51.《小玩意》6/24/2011 14:55 PM" +
                "52. 《社会心理学》6/24/2011 14:55 PM" +
                "53.《程序员修炼之道》6/24/2011 14:55 PM" +
                "54.《我在伊朗长大》6/24/2011 14:55 PM" +
                "55.《目送：龙应台》6/24/2011 14:55 PM" +
                "56.《狼图腾》6/24/2011 14:55 PM" +
                "57.《Maven实战》8/12/2011 12:55 PM" +
                "58.《SEO实战密码》8/12/2011 12:55 PM" +
                "59.《Android技术内幕》8/12/2011 12:55 PM" +
                "60.《1988》8/12/2011 12:55 PM" +
                "61.《窗边的小豆豆》9/1/2011 12:55 PM" +
                "62.《海底捞你学不会》9/1/2011 12:55 PM" +
                "63.《大话数据结构》9/1/2011 12:55 PM" +
                "64.《百年孤独》9/1/2011 12:55 PM" +
                "65.《乔布斯传——神一样的传奇》9/1/2011 12:55 PM" +
                "66.《HTML 5与CSS 3权威指南》9/1/2011 12:55 PM" +
                "67.《黑客与画家》10/14/2011 13:00 PM" +
                "68.《Effective Java中文版 第二版》10/14/2011 13:00 PM" +
                "69.《JAVA 核心技术 卷I》12/03/2011 13:00 PM" +
                "70.《JAVA 核心技术 卷II》12/03/2011 13:00 PM" +
                "71.《美国纽约摄影学院摄影教材（最新修订版）(上册)》 2/06/2012 13:00 PM" +
                "72.《美国纽约摄影学院摄影教材（最新修订版）(下册)》 2/06/2012 13:00 PM" +
                "73.《独唱团 第一辑》 2/15/2012 13:00 PM" +
                "74.《用户体验要素：以用户为中心的产品设计（原书第二版）》 2/15/2012 13:00 PM" +
                "75.《冷浪漫（科学松鼠会）》 2/15/2012 13:00 PM" +
                "76.《他的国》 2/15/2012 13:00 PM" +
                "77.《杂的文》 2/15/2012 13:00 PM" +
                "78.《社交网站的数据挖掘与分析》 2/20/2012 10:00 AM" +
                "79.《世界如此险恶 你要内心强大》  2/20/2012 10:00 AM" +
                "80.《iPhone游戏开发实践指南》  2/20/2012 10:00 AM" +
                "81.《儿子韩寒》  3/8/2012 14:00 PM" +
                "82.《云计算宝典--技术与实践》  3/8/2012 14:00 PM" +
                "83.《HTML5游戏开发》  3/8/2012 14:00 PM" +
                "84.《任天堂传奇：游戏产业之王者归来》  5/10/2012 12:40 PM" +
                "85.《遇见未知的自己：都市身心灵修行课》  5/10/2012 12:40 PM" +
                "86.《新编考研英语阅读理解150篇（基础训练）》  5/10/2012 12:40 PM" +
                "87.《轻量级Java EE企业应用实战（第3版）：Struts 2＋Spring 3＋Hibernate整合开发(含CD光盘1张)》  5/10/2012 12:40 PM" +
                "88.《傲慢与偏见-世界经典读本（英文原版）》  5/10/2012 12:40 PM" +
                "89.《幸福了吗（附白岩松耶鲁大学演讲完整版光盘1张）》  5/10/2012 12:40 PM" +
                "90.《深入理解计算机系统（原书第2版)》  5/10/2012 12:40 PM" +
                "91.《Java测试新技术TestNG和高级概念》  5/28/2012 11:20 AM" +
                "92.《解析极限编程——拥抱变化（原书第2版）》  5/28/2012 11:20 AM" +
                "93.《大象——Thinking in UML（第二版）（UML第一书 紧密结合项目实践 揭秘软件的分析、设计与建模过程）》  5/28/2012 11:20 AM" +
                "94.《围城》6/25/2012 11:20 AM" +
                "95.《高效能人士的七个习惯》6/25/2012 11:20 AM" +
                "96.《巧厨娘家常菜》6/25/2012 11:20 AM" +
                "97.《Objective-C基础教程》6/25/2012 11:20 AM" +
                "98.《青春》韩寒 6/25/2012 11:20 AM" +
                "99.《电脑报2011合订本》6/25/2012 11:20 AM" +
                "100.《那些年，我们一起追的女孩》6/25/2012 11:20 AM" +
                "101.《如丧——我们终于老得可以谈谈未来》6/25/2012 11:20 AM" +
                "102.《中国经济到了最危险的边缘》6/25/2012 11:20 AM" +
                "103.《JavaScript权威指南（第6版）》6/25/2012 11:20 AM" +
                "104.《银河帝国2：基地与帝国》6/25/2012 11:20 AM" +
                "105.《深入理解Java虚拟机：JVM高级特征与最佳实践》8/21/2012 16:08 AM" +
                "106.《上帝掷骰子吗?量子物理史话》8/21/2012 16:08 AM" +
                "107.《童年》高尔基张弛译8/21/2012 16:08 AM" +
                "108.《遥远的救世主》8/21/2012 16:08 AM" +
                "109.《东野圭吾：白夜行》10/23/2012 12:48PM" +
                "110.《麦田里的守望者》110/23/2012 12:48PM" +
                "111.《山海经密码》10/23/2012 12:48PM(一部带您重返中国一切神话、传说与文明源头的奇妙小说)" +
                "112.《红高粱》10/23/2012 12:48PM收入2012年诺贝尔文学奖获得者莫言的成名作《透明的红萝卜》和《红高粱》" +
                "113.《白鹿原》10/23/2012 12:48PM（茅盾文学奖获奖经典作品，权威未删节平装版）" +
                "114.《生死疲劳》10/23/2012 12:48PM（2012诺贝尔文学奖获得者莫言最新长篇小说，一部划时代的史诗性作品，是中国文学终于跳出图解概念沼泽最辉煌的标志性著作。）" +
                "115.《设计模式-可复用面向对象软件的基础》11/16/2012 13:48PM" +
                "116.《人生需要揭穿》11/16/2012 13:48PM" +
                "117.《大数据-互联网大规模数据挖掘与分布式处理》11/16/2012 13:48PM" +
                "118.《动物大百科》11/16/2012 13:48PM" +
                "119.《软件项目成功之道》11/16/2012 13:48PM" +
                "120.《图灵程序设计丛书：程序员的数学》6/18/2013 11:10PM" +
                "121.《精通CSS:高级Web标准解决方案（第二版）》6/18/2013 11:10PM" +
                "122.《疯狂Android讲义（第二版）》6/18/2013 11:10PM" +
                "123.《谁说菜鸟不会数据分析（入门篇）》6/18/2013 11:10PM" +
                "124.《数据结构与算法分析：Java语言描述（第2版）》6/18/2013 11:10PM" +
                "125.《用户故事与敏捷方法》6/18/2013 11:10PM" +
                "126.《人人都是产品经理 version1.1》6/18/2013 11:10PM" +
                "127.《浪潮之巅》6/18/2013 11:10PM" +
                "128.《数据挖掘实用机器学习技术（原书第2版）》6/18/2013 11:10PM" +
                "129.《O’Reilly:MongoDB权威指南》6/18/2013 11:10PM" +
                "130.《离散数学及其应用》 7/03/2013 14:10PM" +
                "131.《物种起源》 7/03/2013 14:10PM" +
                "132.《软件设计师教程（第三版）》 11/05/2013 15:10 PM" +
                "133.《数学之美》 11/05/2013 15:10 PM" +
                "134.《我的第一个苹果游戏——iPhone/iPad高端3D游戏从创意到App Store全程实录》 11/05/2013 15:10 PM" +
                "135.《Cocos2d-x高级开发教程：制作自己的《捕鱼达人》》 11/05/2013 15:10 PM" +
                "136.《拖延心理学：向与生俱来的行为顽症宣战(风靡全球25年经典之作、25周年钻石版,豆瓣拖延小组的镇组之宝)》 26/02/2014 15:10 PM" +
                "" +
                "137.《自控力：斯坦福大学最受欢迎心理学课程（提高自控力的最有效途径，在于弄清自己如何失控、为何失控）》 26/02/2014 15:10 PM" +
                "138.《追风筝的人》 04/01/2014 11:10 AM" +
                "139.《偷影子的人》 04/01/2014 11:10 AM" +
                "140.《数据挖掘概念与技术》 04/01/2014 11:10 AM" +
                "141.《IOS开发指南--从零基础到App Store上架》 04/01/2014 11:10 AM" +
                "142.《Spring实战》 07/23/2014 11:10 AM" +
                "143.《锋利的jQuery》 07/23/2014 11:10 AM" +
                "144.《微信公众平台搭建与开发揭秘》 07/23/2014 11:10 AM"+"1.<现在,发现你的优势>  9787500648192 12/28/2009 3:50 PM" +
                "2.<小王子>圣.埃克苏佩里 9787802282902  12/28/2009 3:50 PM" +
                "3.<梦的解析>弗洛伊德 9787805797205 1/4/2010 6:45 PM" +
                "4.<精神分析学引论.新论>弗洛伊德 97878057972121/4/2010 6:45 PM" +
                "5.<性学与爱情心理学>弗洛伊德 9787805797199  1/4/2010 6:46 PM" +
                "6.<明朝那些事儿>第一部当年明月  9787505722460 1/10/2010 2:21 PM" +
                "7.<明朝那些事儿>第二部当年明月  9787505722859  1/10/2010 2:21 PM" +
                "8.<明朝那些事儿>第三部当年明月 9787505723269 1/10/2010 2:21 PM" +
                "9.<杜拉拉升职记>李可 9787561339121 1/10/2010 2:21 PM" +
                "10.<世界因你不同>李开复范海涛 9787508616780 1/10/2010 2:21 PM" +
                "11.<我们台湾这些年>廖信忠 9787229012755 1/10/2010 2:21 PM" +
                "12.<秘密>1/17/2010 2:21 PM" +
                "13.<激荡三十年>上1/17/2010 2:21 PM" +
                "14.<激荡三十年>下1/17/2010 2:21 PM" +
                "15.<算法导论>1/27/2010 2:21 PM" +
                "16.<人性的弱点>2/5/2010 2:21 PM" +
                "17.<穆斯林的葬礼> 2/5/2010 2:21 PM" +
                "18.<神秘岛>凡尔纳  2/9/2010 2:21 PM" +
                "19.<格兰特船长的儿女>凡尔纳  2/9/2010 2:21 PM" +
                "20.<八十天环游地球>凡尔纳  2/9/2010 2:21 PM" +
                "21.<海底两万里>凡尔纳  2/9/2010 2:21 PM" +
                "22.<聊斋志异>3/10/2010 2:03 PM" +
                "23.<东周列国志>3/10/2010 2:03 PM" +
                "24.<搜神记>3/10/2010 2:08 PM" +
                "25.<程序员2009精华本>3/12/2010 10:08 AM" +
                "26.<Android应用开发揭秘>3/12/2010 10:08 AM" +
                "27.<经济学>第18版萨缪尔森3/17/2010 10:08 AM" +
                "28.<Ajax与Java高级程序设计>3/17/2010 10:08 AM" +
                "29.<明朝那些事儿>第四部  4/12/2010 10:08 AM" +
                "30.<少有人走的路:心智成熟的旅程>  5/7/2010 10:08 AM" +
                "31.<高校程序员的45个习惯:敏捷开发修炼之道> 5/7/2010 10:08 AM" +
                "32.<明朝那些事儿第五部>  5/10/2010 10:08 AM" +
                "33.<明朝那些事儿第六部>  5/10/2010 10:08 AM" +
                "34.<明朝那些事儿第七部大结局>  5/10/2010 10:08 AM" +
                "35.<丁丁历险记全集>共22本  5/21/2010 10:30AM" +
                "36.<侯卫东官场笔记>  6/17/2010 12:30AM" +
                "37.<走出软件作坊>  6/17/2010 12:30AM" +
                "38.<时间简史> 7/05/2010 12:30AM" +
                "39.<Agile Java中文版:测试驱动开发的编程技术>  7/05/2010 12:30AM" +
                "40.《大话设计模式》1/02/2011 1:00:21 AM" +
                "41.《重构改善既有代码的设计》4/16/2011 12:55 AM" +
                "42.《普通心理学》》4/26/2011 12:55 AM" +
                "43. 《看懂世界格局的第一本书》》5/5/2011 16:55 AM" +
                "44.《经济学原理 微观经济学分册》5/5/2011 16:55 AM" +
                "45.《经济学原理 宏观经济学分册》5/5/2011 16:55 AM" +
                "46.《致我们终将逝去的青春》5/5/2011 16:55 AM" +
                "47.《代码大全》第二版 5/15/2011 14:55 AM" +
                "48.《见证通胀》 6/08/2011 14:55 PM" +
                "49.《人月神话》 6/08/2011 14:55 PM" +
                "50.《下一个十年，消费崩盘的年代》6/24/2011 14:55 PM" +
                "51.《小玩意》6/24/2011 14:55 PM" +
                "52. 《社会心理学》6/24/2011 14:55 PM" +
                "53.《程序员修炼之道》6/24/2011 14:55 PM" +
                "54.《我在伊朗长大》6/24/2011 14:55 PM" +
                "55.《目送：龙应台》6/24/2011 14:55 PM" +
                "56.《狼图腾》6/24/2011 14:55 PM" +
                "57.《Maven实战》8/12/2011 12:55 PM" +
                "58.《SEO实战密码》8/12/2011 12:55 PM" +
                "59.《Android技术内幕》8/12/2011 12:55 PM" +
                "60.《1988》8/12/2011 12:55 PM" +
                "61.《窗边的小豆豆》9/1/2011 12:55 PM" +
                "62.《海底捞你学不会》9/1/2011 12:55 PM" +
                "63.《大话数据结构》9/1/2011 12:55 PM" +
                "64.《百年孤独》9/1/2011 12:55 PM" +
                "65.《乔布斯传——神一样的传奇》9/1/2011 12:55 PM" +
                "66.《HTML 5与CSS 3权威指南》9/1/2011 12:55 PM" +
                "67.《黑客与画家》10/14/2011 13:00 PM" +
                "68.《Effective Java中文版 第二版》10/14/2011 13:00 PM" +
                "69.《JAVA 核心技术 卷I》12/03/2011 13:00 PM" +
                "70.《JAVA 核心技术 卷II》12/03/2011 13:00 PM" +
                "71.《美国纽约摄影学院摄影教材（最新修订版）(上册)》 2/06/2012 13:00 PM" +
                "72.《美国纽约摄影学院摄影教材（最新修订版）(下册)》 2/06/2012 13:00 PM" +
                "73.《独唱团 第一辑》 2/15/2012 13:00 PM" +
                "74.《用户体验要素：以用户为中心的产品设计（原书第二版）》 2/15/2012 13:00 PM" +
                "75.《冷浪漫（科学松鼠会）》 2/15/2012 13:00 PM" +
                "76.《他的国》 2/15/2012 13:00 PM" +
                "77.《杂的文》 2/15/2012 13:00 PM" +
                "78.《社交网站的数据挖掘与分析》 2/20/2012 10:00 AM" +
                "79.《世界如此险恶 你要内心强大》  2/20/2012 10:00 AM" +
                "80.《iPhone游戏开发实践指南》  2/20/2012 10:00 AM" +
                "81.《儿子韩寒》  3/8/2012 14:00 PM" +
                "82.《云计算宝典--技术与实践》  3/8/2012 14:00 PM" +
                "83.《HTML5游戏开发》  3/8/2012 14:00 PM" +
                "84.《任天堂传奇：游戏产业之王者归来》  5/10/2012 12:40 PM" +
                "85.《遇见未知的自己：都市身心灵修行课》  5/10/2012 12:40 PM" +
                "86.《新编考研英语阅读理解150篇（基础训练）》  5/10/2012 12:40 PM" +
                "87.《轻量级Java EE企业应用实战（第3版）：Struts 2＋Spring 3＋Hibernate整合开发(含CD光盘1张)》  5/10/2012 12:40 PM" +
                "88.《傲慢与偏见-世界经典读本（英文原版）》  5/10/2012 12:40 PM" +
                "89.《幸福了吗（附白岩松耶鲁大学演讲完整版光盘1张）》  5/10/2012 12:40 PM" +
                "90.《深入理解计算机系统（原书第2版)》  5/10/2012 12:40 PM" +
                "91.《Java测试新技术TestNG和高级概念》  5/28/2012 11:20 AM" +
                "92.《解析极限编程——拥抱变化（原书第2版）》  5/28/2012 11:20 AM" +
                "93.《大象——Thinking in UML（第二版）（UML第一书 紧密结合项目实践 揭秘软件的分析、设计与建模过程）》  5/28/2012 11:20 AM" +
                "94.《围城》6/25/2012 11:20 AM" +
                "95.《高效能人士的七个习惯》6/25/2012 11:20 AM" +
                "96.《巧厨娘家常菜》6/25/2012 11:20 AM" +
                "97.《Objective-C基础教程》6/25/2012 11:20 AM" +
                "98.《青春》韩寒 6/25/2012 11:20 AM" +
                "99.《电脑报2011合订本》6/25/2012 11:20 AM" +
                "100.《那些年，我们一起追的女孩》6/25/2012 11:20 AM" +
                "101.《如丧——我们终于老得可以谈谈未来》6/25/2012 11:20 AM" +
                "102.《中国经济到了最危险的边缘》6/25/2012 11:20 AM" +
                "103.《JavaScript权威指南（第6版）》6/25/2012 11:20 AM" +
                "104.《银河帝国2：基地与帝国》6/25/2012 11:20 AM" +
                "105.《深入理解Java虚拟机：JVM高级特征与最佳实践》8/21/2012 16:08 AM" +
                "106.《上帝掷骰子吗?量子物理史话》8/21/2012 16:08 AM" +
                "107.《童年》高尔基张弛译8/21/2012 16:08 AM" +
                "108.《遥远的救世主》8/21/2012 16:08 AM" +
                "109.《东野圭吾：白夜行》10/23/2012 12:48PM" +
                "110.《麦田里的守望者》110/23/2012 12:48PM" +
                "111.《山海经密码》10/23/2012 12:48PM(一部带您重返中国一切神话、传说与文明源头的奇妙小说)" +
                "112.《红高粱》10/23/2012 12:48PM收入2012年诺贝尔文学奖获得者莫言的成名作《透明的红萝卜》和《红高粱》" +
                "113.《白鹿原》10/23/2012 12:48PM（茅盾文学奖获奖经典作品，权威未删节平装版）" +
                "114.《生死疲劳》10/23/2012 12:48PM（2012诺贝尔文学奖获得者莫言最新长篇小说，一部划时代的史诗性作品，是中国文学终于跳出图解概念沼泽最辉煌的标志性著作。）" +
                "115.《设计模式-可复用面向对象软件的基础》11/16/2012 13:48PM" +
                "116.《人生需要揭穿》11/16/2012 13:48PM" +
                "117.《大数据-互联网大规模数据挖掘与分布式处理》11/16/2012 13:48PM" +
                "118.《动物大百科》11/16/2012 13:48PM" +
                "119.《软件项目成功之道》11/16/2012 13:48PM" +
                "120.《图灵程序设计丛书：程序员的数学》6/18/2013 11:10PM" +
                "121.《精通CSS:高级Web标准解决方案（第二版）》6/18/2013 11:10PM" +
                "122.《疯狂Android讲义（第二版）》6/18/2013 11:10PM" +
                "123.《谁说菜鸟不会数据分析（入门篇）》6/18/2013 11:10PM" +
                "124.《数据结构与算法分析：Java语言描述（第2版）》6/18/2013 11:10PM" +
                "125.《用户故事与敏捷方法》6/18/2013 11:10PM" +
                "126.《人人都是产品经理 version1.1》6/18/2013 11:10PM" +
                "127.《浪潮之巅》6/18/2013 11:10PM" +
                "128.《数据挖掘实用机器学习技术（原书第2版）》6/18/2013 11:10PM" +
                "129.《O’Reilly:MongoDB权威指南》6/18/2013 11:10PM" +
                "130.《离散数学及其应用》 7/03/2013 14:10PM" +
                "131.《物种起源》 7/03/2013 14:10PM" +
                "132.《软件设计师教程（第三版）》 11/05/2013 15:10 PM" +
                "133.《数学之美》 11/05/2013 15:10 PM" +
                "134.《我的第一个苹果游戏——iPhone/iPad高端3D游戏从创意到App Store全程实录》 11/05/2013 15:10 PM" +
                "135.《Cocos2d-x高级开发教程：制作自己的《捕鱼达人》》 11/05/2013 15:10 PM" +
                "136.《拖延心理学：向与生俱来的行为顽症宣战(风靡全球25年经典之作、25周年钻石版,豆瓣拖延小组的镇组之宝)》 26/02/2014 15:10 PM" +
                "" +
                "137.《自控力：斯坦福大学最受欢迎心理学课程（提高自控力的最有效途径，在于弄清自己如何失控、为何失控）》 26/02/2014 15:10 PM" +
                "138.《追风筝的人》 04/01/2014 11:10 AM" +
                "139.《偷影子的人》 04/01/2014 11:10 AM" +
                "140.《数据挖掘概念与技术》 04/01/2014 11:10 AM" +
                "141.《IOS开发指南--从零基础到App Store上架》 04/01/2014 11:10 AM" +
                "142.《Spring实战》 07/23/2014 11:10 AM" +
                "143.《锋利的jQuery》 07/23/2014 11:10 AM" +
                "144.《微信公众平台搭建与开发揭秘》 07/23/2014 11:10 AM"+"1.<现在,发现你的优势>  9787500648192 12/28/2009 3:50 PM" +
                "2.<小王子>圣.埃克苏佩里 9787802282902  12/28/2009 3:50 PM" +
                "3.<梦的解析>弗洛伊德 9787805797205 1/4/2010 6:45 PM" +
                "4.<精神分析学引论.新论>弗洛伊德 97878057972121/4/2010 6:45 PM" +
                "5.<性学与爱情心理学>弗洛伊德 9787805797199  1/4/2010 6:46 PM" +
                "6.<明朝那些事儿>第一部当年明月  9787505722460 1/10/2010 2:21 PM" +
                "7.<明朝那些事儿>第二部当年明月  9787505722859  1/10/2010 2:21 PM" +
                "8.<明朝那些事儿>第三部当年明月 9787505723269 1/10/2010 2:21 PM" +
                "9.<杜拉拉升职记>李可 9787561339121 1/10/2010 2:21 PM" +
                "10.<世界因你不同>李开复范海涛 9787508616780 1/10/2010 2:21 PM" +
                "11.<我们台湾这些年>廖信忠 9787229012755 1/10/2010 2:21 PM" +
                "12.<秘密>1/17/2010 2:21 PM" +
                "13.<激荡三十年>上1/17/2010 2:21 PM" +
                "14.<激荡三十年>下1/17/2010 2:21 PM" +
                "15.<算法导论>1/27/2010 2:21 PM" +
                "16.<人性的弱点>2/5/2010 2:21 PM" +
                "17.<穆斯林的葬礼> 2/5/2010 2:21 PM" +
                "18.<神秘岛>凡尔纳  2/9/2010 2:21 PM" +
                "19.<格兰特船长的儿女>凡尔纳  2/9/2010 2:21 PM" +
                "20.<八十天环游地球>凡尔纳  2/9/2010 2:21 PM" +
                "21.<海底两万里>凡尔纳  2/9/2010 2:21 PM" +
                "22.<聊斋志异>3/10/2010 2:03 PM" +
                "23.<东周列国志>3/10/2010 2:03 PM" +
                "24.<搜神记>3/10/2010 2:08 PM" +
                "25.<程序员2009精华本>3/12/2010 10:08 AM" +
                "26.<Android应用开发揭秘>3/12/2010 10:08 AM" +
                "27.<经济学>第18版萨缪尔森3/17/2010 10:08 AM" +
                "28.<Ajax与Java高级程序设计>3/17/2010 10:08 AM" +
                "29.<明朝那些事儿>第四部  4/12/2010 10:08 AM" +
                "30.<少有人走的路:心智成熟的旅程>  5/7/2010 10:08 AM" +
                "31.<高校程序员的45个习惯:敏捷开发修炼之道> 5/7/2010 10:08 AM" +
                "32.<明朝那些事儿第五部>  5/10/2010 10:08 AM" +
                "33.<明朝那些事儿第六部>  5/10/2010 10:08 AM" +
                "34.<明朝那些事儿第七部大结局>  5/10/2010 10:08 AM" +
                "35.<丁丁历险记全集>共22本  5/21/2010 10:30AM" +
                "36.<侯卫东官场笔记>  6/17/2010 12:30AM" +
                "37.<走出软件作坊>  6/17/2010 12:30AM" +
                "38.<时间简史> 7/05/2010 12:30AM" +
                "39.<Agile Java中文版:测试驱动开发的编程技术>  7/05/2010 12:30AM" +
                "40.《大话设计模式》1/02/2011 1:00:21 AM" +
                "41.《重构改善既有代码的设计》4/16/2011 12:55 AM" +
                "42.《普通心理学》》4/26/2011 12:55 AM" +
                "43. 《看懂世界格局的第一本书》》5/5/2011 16:55 AM" +
                "44.《经济学原理 微观经济学分册》5/5/2011 16:55 AM" +
                "45.《经济学原理 宏观经济学分册》5/5/2011 16:55 AM" +
                "46.《致我们终将逝去的青春》5/5/2011 16:55 AM" +
                "47.《代码大全》第二版 5/15/2011 14:55 AM" +
                "48.《见证通胀》 6/08/2011 14:55 PM" +
                "49.《人月神话》 6/08/2011 14:55 PM" +
                "50.《下一个十年，消费崩盘的年代》6/24/2011 14:55 PM" +
                "51.《小玩意》6/24/2011 14:55 PM" +
                "52. 《社会心理学》6/24/2011 14:55 PM" +
                "53.《程序员修炼之道》6/24/2011 14:55 PM" +
                "54.《我在伊朗长大》6/24/2011 14:55 PM" +
                "55.《目送：龙应台》6/24/2011 14:55 PM" +
                "56.《狼图腾》6/24/2011 14:55 PM" +
                "57.《Maven实战》8/12/2011 12:55 PM" +
                "58.《SEO实战密码》8/12/2011 12:55 PM" +
                "59.《Android技术内幕》8/12/2011 12:55 PM" +
                "60.《1988》8/12/2011 12:55 PM" +
                "61.《窗边的小豆豆》9/1/2011 12:55 PM" +
                "62.《海底捞你学不会》9/1/2011 12:55 PM" +
                "63.《大话数据结构》9/1/2011 12:55 PM" +
                "64.《百年孤独》9/1/2011 12:55 PM" +
                "65.《乔布斯传——神一样的传奇》9/1/2011 12:55 PM" +
                "66.《HTML 5与CSS 3权威指南》9/1/2011 12:55 PM" +
                "67.《黑客与画家》10/14/2011 13:00 PM" +
                "68.《Effective Java中文版 第二版》10/14/2011 13:00 PM" +
                "69.《JAVA 核心技术 卷I》12/03/2011 13:00 PM" +
                "70.《JAVA 核心技术 卷II》12/03/2011 13:00 PM" +
                "71.《美国纽约摄影学院摄影教材（最新修订版）(上册)》 2/06/2012 13:00 PM" +
                "72.《美国纽约摄影学院摄影教材（最新修订版）(下册)》 2/06/2012 13:00 PM" +
                "73.《独唱团 第一辑》 2/15/2012 13:00 PM" +
                "74.《用户体验要素：以用户为中心的产品设计（原书第二版）》 2/15/2012 13:00 PM" +
                "75.《冷浪漫（科学松鼠会）》 2/15/2012 13:00 PM" +
                "76.《他的国》 2/15/2012 13:00 PM" +
                "77.《杂的文》 2/15/2012 13:00 PM" +
                "78.《社交网站的数据挖掘与分析》 2/20/2012 10:00 AM" +
                "79.《世界如此险恶 你要内心强大》  2/20/2012 10:00 AM" +
                "80.《iPhone游戏开发实践指南》  2/20/2012 10:00 AM" +
                "81.《儿子韩寒》  3/8/2012 14:00 PM" +
                "82.《云计算宝典--技术与实践》  3/8/2012 14:00 PM" +
                "83.《HTML5游戏开发》  3/8/2012 14:00 PM" +
                "84.《任天堂传奇：游戏产业之王者归来》  5/10/2012 12:40 PM" +
                "85.《遇见未知的自己：都市身心灵修行课》  5/10/2012 12:40 PM" +
                "86.《新编考研英语阅读理解150篇（基础训练）》  5/10/2012 12:40 PM" +
                "87.《轻量级Java EE企业应用实战（第3版）：Struts 2＋Spring 3＋Hibernate整合开发(含CD光盘1张)》  5/10/2012 12:40 PM" +
                "88.《傲慢与偏见-世界经典读本（英文原版）》  5/10/2012 12:40 PM" +
                "89.《幸福了吗（附白岩松耶鲁大学演讲完整版光盘1张）》  5/10/2012 12:40 PM" +
                "90.《深入理解计算机系统（原书第2版)》  5/10/2012 12:40 PM" +
                "91.《Java测试新技术TestNG和高级概念》  5/28/2012 11:20 AM" +
                "92.《解析极限编程——拥抱变化（原书第2版）》  5/28/2012 11:20 AM" +
                "93.《大象——Thinking in UML（第二版）（UML第一书 紧密结合项目实践 揭秘软件的分析、设计与建模过程）》  5/28/2012 11:20 AM" +
                "94.《围城》6/25/2012 11:20 AM" +
                "95.《高效能人士的七个习惯》6/25/2012 11:20 AM" +
                "96.《巧厨娘家常菜》6/25/2012 11:20 AM" +
                "97.《Objective-C基础教程》6/25/2012 11:20 AM" +
                "98.《青春》韩寒 6/25/2012 11:20 AM" +
                "99.《电脑报2011合订本》6/25/2012 11:20 AM" +
                "100.《那些年，我们一起追的女孩》6/25/2012 11:20 AM" +
                "101.《如丧——我们终于老得可以谈谈未来》6/25/2012 11:20 AM" +
                "102.《中国经济到了最危险的边缘》6/25/2012 11:20 AM" +
                "103.《JavaScript权威指南（第6版）》6/25/2012 11:20 AM" +
                "104.《银河帝国2：基地与帝国》6/25/2012 11:20 AM" +
                "105.《深入理解Java虚拟机：JVM高级特征与最佳实践》8/21/2012 16:08 AM" +
                "106.《上帝掷骰子吗?量子物理史话》8/21/2012 16:08 AM" +
                "107.《童年》高尔基张弛译8/21/2012 16:08 AM" +
                "108.《遥远的救世主》8/21/2012 16:08 AM" +
                "109.《东野圭吾：白夜行》10/23/2012 12:48PM" +
                "110.《麦田里的守望者》110/23/2012 12:48PM" +
                "111.《山海经密码》10/23/2012 12:48PM(一部带您重返中国一切神话、传说与文明源头的奇妙小说)" +
                "112.《红高粱》10/23/2012 12:48PM收入2012年诺贝尔文学奖获得者莫言的成名作《透明的红萝卜》和《红高粱》" +
                "113.《白鹿原》10/23/2012 12:48PM（茅盾文学奖获奖经典作品，权威未删节平装版）" +
                "114.《生死疲劳》10/23/2012 12:48PM（2012诺贝尔文学奖获得者莫言最新长篇小说，一部划时代的史诗性作品，是中国文学终于跳出图解概念沼泽最辉煌的标志性著作。）" +
                "115.《设计模式-可复用面向对象软件的基础》11/16/2012 13:48PM" +
                "116.《人生需要揭穿》11/16/2012 13:48PM" +
                "117.《大数据-互联网大规模数据挖掘与分布式处理》11/16/2012 13:48PM" +
                "118.《动物大百科》11/16/2012 13:48PM" +
                "119.《软件项目成功之道》11/16/2012 13:48PM" +
                "120.《图灵程序设计丛书：程序员的数学》6/18/2013 11:10PM" +
                "121.《精通CSS:高级Web标准解决方案（第二版）》6/18/2013 11:10PM" +
                "122.《疯狂Android讲义（第二版）》6/18/2013 11:10PM" +
                "123.《谁说菜鸟不会数据分析（入门篇）》6/18/2013 11:10PM" +
                "124.《数据结构与算法分析：Java语言描述（第2版）》6/18/2013 11:10PM" +
                "125.《用户故事与敏捷方法》6/18/2013 11:10PM" +
                "126.《人人都是产品经理 version1.1》6/18/2013 11:10PM" +
                "127.《浪潮之巅》6/18/2013 11:10PM" +
                "128.《数据挖掘实用机器学习技术（原书第2版）》6/18/2013 11:10PM" +
                "129.《O’Reilly:MongoDB权威指南》6/18/2013 11:10PM" +
                "130.《离散数学及其应用》 7/03/2013 14:10PM" +
                "131.《物种起源》 7/03/2013 14:10PM" +
                "132.《软件设计师教程（第三版）》 11/05/2013 15:10 PM" +
                "133.《数学之美》 11/05/2013 15:10 PM" +
                "134.《我的第一个苹果游戏——iPhone/iPad高端3D游戏从创意到App Store全程实录》 11/05/2013 15:10 PM" +
                "135.《Cocos2d-x高级开发教程：制作自己的《捕鱼达人》》 11/05/2013 15:10 PM" +
                "136.《拖延心理学：向与生俱来的行为顽症宣战(风靡全球25年经典之作、25周年钻石版,豆瓣拖延小组的镇组之宝)》 26/02/2014 15:10 PM" +
                "" +
                "137.《自控力：斯坦福大学最受欢迎心理学课程（提高自控力的最有效途径，在于弄清自己如何失控、为何失控）》 26/02/2014 15:10 PM" +
                "138.《追风筝的人》 04/01/2014 11:10 AM" +
                "139.《偷影子的人》 04/01/2014 11:10 AM" +
                "140.《数据挖掘概念与技术》 04/01/2014 11:10 AM" +
                "141.《IOS开发指南--从零基础到App Store上架》 04/01/2014 11:10 AM" +
                "142.《Spring实战》 07/23/2014 11:10 AM" +
                "143.《锋利的jQuery》 07/23/2014 11:10 AM" +
                "144.《微信公众平台搭建与开发揭秘》 07/23/2014 11:10 AM"+"1.<现在,发现你的优势>  9787500648192 12/28/2009 3:50 PM" ;



        Long time3 = new Date().getTime();
        System.out.println("Time used:["+(time3-time2)+"]");
        */
    }
}
